#Database and SQL Final Project (Part 3)

##Name: Mansuur Caamir

**Make sure to "save" a copy of this file to your own account.**
**NOTE: Please include ALL of the parts of your final project (1, 2, and 3) for this submission, as this will be the last lab!**.

Exam 3 for the course will take the form of a “final project” where you will take a set of business rules (which you can find  below). and do the following.


1.	Formulate business rules
2.	Construct an ERD from a set of business rules
3.	Specify the relational schema
4.	Discuss whether this schema meets the 1N, 2N, and 3N normal forms
5.	Create the tables using SQL queries
6.	Run sample SQL queries that demonstrate your ability to
  
  a.	Create table with primary keys and multiple data types

  b.	Join tables with foreign keys

  c.	Insert sample data into tables

  d.	Update existing data in the table

  e.	Delete data from the table
7.	Run sample SQL queries that demonstrate your ability to do the following:

  a.	Simple single table queries

  b.	Single-table queries with WHERE and LIKE

  c.	Single-table queries with aggregate functions

  d.	Single table queries with GROUP BY

  e.	Single-table queries with HAVING

  f.	Subqueries

  g.	Simple multi-table queries with JOIN

  h.	More complex multi-table queries

  i.	The creation of table views
  
  j.	The creation of indexes
8.	Discuss your process of database design and implementation using the Software Development LifeCycle Model 
9.	Do something unique! You could do ONE of the following, or something else:

  a.	Build some indexes and analyze query performance

  b.	Figure out how to add a JSON column, and insert data

  c.	Write a PL/SQL functions or trigger and show how to use it

  d.	Expand the data model to include subtypes and supertypes

  e.	Let your creativity shine!
10.	Save this project as a portfolio-quality work to Github, which you can then share with me (and with future employers, if you would like).
The overall project is worth 100 points. We’ll be working on pieces of this for each of our “labs” from now until the end of the semester.


**Other Guidelines** Here are the guidelines for working on the project:

1. Each week, you should share your project with me to show me how you're doing. If you complete the required steps for that week, you'll receive full credit for the lab.
2. You are welcome to discuss your project with either me or your peers. However, your final work (for example, the ER diagram,  SQL code, etc.) should represent your *own* response. 
3. Each "step" in the lab will be worth ten points total (for a total of 100 points).

#Load Postgres (Run This Cell)

In [1]:
# Some UNIX utilites we need to install for the lab.
!pip install wget --quiet
!pip install sqlalchemy --quiet
!pip install ipython-sql --quiet

# Install postgresql server
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!pip install pgspecial --quiet

!sudo service postgresql start


# Setup a password `postgres` for username `postgres`
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

# Setup a postgres database with name `my_data` to be used
!sudo -u postgres psql -U postgres -c 'DROP DATABASE IF EXISTS my_data;'

!sudo -u postgres psql -U postgres -c 'CREATE DATABASE my_data;'

# Postgres variables
%env DB_NAME=my_data
%env DB_HOST=localhost
%env DB_PORT=5432
%env DB_USER=postgres
%env DB_PASS=postgres

# Finally, let's make a connnection with the databse
%load_ext sql
%sql postgresql://$DB_USER:$DB_PASS@$DB_HOST/$DB_NAME

  Building wheel for wget (setup.py) ... done
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76, <> line 10.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package cron.
(Reading database ... 155203 files and directories currently installed.)
Preparing to unpack .../0-cron_3.0pl1-128.1ubuntu1.1_amd64.deb ...
Unpacking cron (3.0pl1-128.1ubuntu1.1) ...
Selecting previously unselected package logrotate.
Preparing to unpack .../1-logrotate_3.11.0-0.1ubuntu1_amd64.deb ...
Unpacking logrotate (3.11.0-0.1ubuntu1) ...
Selecting previously unselected package netbase.
Preparing to unpack .../2-netbase_5.4_all.deb ...
Unpacking netbase (5.4) ...
Selecting previously unselected package postgresql-client-common.
Preparing to unpack .../3-postgresql-client-common_190ubuntu0.1_all.deb ...
Unpacking postgresql-client-common (190ubuntu0.1) ...
Selecting previously unselected package postgresql-client-10.
Preparing to unpack .../4-postgresql-client-10_10.19-0ubuntu0.18.04.1_amd64.deb ...
Unpacking postgresql-client-10 (10.19-0ubuntu0.18.04.1) ...
Selecting previously unselected package ssl-cert.
Preparing to unpack .../5-ssl-cert_1.0.39_all.deb ...
Unpacking ssl-cert (1.0.39) ...
Selecting previously unselected package postgresql-common.
Preparing to unpack .../6-postgresql-common_190ubuntu0.1_all.deb ...
Adding 'diversion of /usr/bin/pg_config to /usr/bin/pg_config.libpq-dev by postgresql-common'
Unpacking postgresql-common (190ubuntu0.1) ...
Selecting previously unselected package postgresql-10.
Preparing to unpack .../7-postgresql-10_10.19-0ubuntu0.18.04.1_amd64.deb ...
Unpacking postgresql-10 (10.19-0ubuntu0.18.04.1) ...
Selecting previously unselected package postgresql.
Preparing to unpack .../8-postgresql_10+190ubuntu0.1_all.deb ...
Unpacking postgresql (10+190ubuntu0.1) ...
Selecting previously unselected package sysstat.
Preparing to unpack .../9-sysstat_11.6.1-1ubuntu0.1_amd64.deb ...
Unpacking sysstat (11.6.1-1ubuntu0.1) ...
Setting up sysstat (11.6.1-1ubuntu0.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline

Creating config file /etc/default/sysstat with new version
update-alternatives: using /usr/bin/sar.sysstat to provide /usr/bin/sar (sar) in auto mode
Created symlink /etc/systemd/system/multi-user.target.wants/sysstat.service → /lib/systemd/system/sysstat.service.
Setting up ssl-cert (1.0.39) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Setting up cron (3.0pl1-128.1ubuntu1.1) ...
Adding group `crontab' (GID 110) ...
Done.
stat: cannot stat '*': No such file or directory
stat: cannot stat '*': No such file or directory
stat: cannot stat '*': No such file or directory
Warning: * is not a regular file!
Created symlink /etc/systemd/system/multi-user.target.wants/cron.service → /lib/systemd/system/cron.service.
update-rc.d: warning: start and stop actions are no longer supported; falling back to defaults
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up logrotate (3.11.0-0.1ubuntu1) ...
Setting up netbase (5.4) ...
Setting up postgresql-client-common (190ubuntu0.1) ...
Setting up postgresql-common (190ubuntu0.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Adding user postgres to group ssl-cert

Creating config file /etc/postgresql-common/createcluster.conf with new version
Building PostgreSQL dictionaries from installed myspell/hunspell packages...
Removing obsolete dictionary files:
Created symlink /etc/systemd/system/multi-user.target.wants/postgresql.service → /lib/systemd/system/postgresql.service.
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql-client-10 (10.19-0ubuntu0.18.04.1) ...
update-alternatives: using /usr/share/postgresql/10/man/man1/psql.1.gz to provide /usr/share/man/man1/psql.1.gz (psql.1.gz) in auto mode
Setting up postgresql-10 (10.19-0ubuntu0.18.04.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Creating new PostgreSQL cluster 10/main ...
/usr/lib/postgresql/10/bin/initdb -D /var/lib/postgresql/10/main --auth-local peer --auth-host md5
The files belonging to this database system will be owned by user "postgres".
This user must also own the server process.

The database cluster will be initialized with locale "en_US.UTF-8".
The default database encoding has accordingly been set to "UTF8".
The default text search configuration will be set to "english".

Data page checksums are disabled.

fixing permissions on existing directory /var/lib/postgresql/10/main ... ok
creating subdirectories ... ok
selecting default max_connections ... 100
selecting default shared_buffers ... 128MB
selecting default timezone ... Etc/UTC
selecting dynamic shared memory implementation ... posix
creating configuration files ... ok
running bootstrap script ... ok
performing post-bootstrap initialization ... ok
syncing data to disk ... ok

Success. You can now start the database server using:

    /usr/lib/postgresql/10/bin/pg_ctl -D /var/lib/postgresql/10/main -l logfile start

Ver Cluster Port Status Owner    Data directory              Log file
10  main    5432 down   postgres /var/lib/postgresql/10/main /var/log/postgresql/postgresql-10-main.log
update-alternatives: using /usr/share/postgresql/10/man/man1/postmaster.1.gz to provide /usr/share/man/man1/postmaster.1.gz (postmaster.1.gz) in auto mode
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql (10+190ubuntu0.1) ...
Processing triggers for man-db (2.8.3-2ubuntu0.1) ...
Processing triggers for systemd (237-3ubuntu10.53) ...
 * Starting PostgreSQL 10 database server
   ...done.
ALTER ROLE
NOTICE:  database "my_data" does not exist, skipping
DROP DATABASE
CREATE DATABASE
env: DB_NAME=my_data
env: DB_HOST=localhost
env: DB_PORT=5432
env: DB_USER=postgres
env: DB_PASS=postgres

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: postgres@my_data'

#Part 1: Scenario Analysis and Business Rule Formulation
For the project, you’ll be creating a mock database for “Monster University,” a school that takes young monsters (dragons, werewolves, cute “ET” style aliens, vampires, ogres, talking apes, robot assassins, and basically anything else you want) and teaches them to be upstanding members of the monster community. The professors are ALSO monsters. Here are the business rules you’ll need to get started:

1.	Your main goal is to represent the Monsters, Classes, and Locations (buildings/rooms) at the school.
2.	Monsters can either teach classes, take classes, or both.
3.	For all Monsters we need to keep track of their 

  a.	name

  b.	species (what kind of monster are they?)

  c.	date of birth

  d.	their diet, if known (herbivore, carnivore, omnivore, “brains”, “electricity”, etc.)

  e. their GPA (between 0 and 4.0)

  f. the number of credits completed.

4.	For classes, we’d like to track the following:

  a.	The title of the class

  b.	The location in which the class is held

  c.	The duration of the class in minutes (between 30 and 180)

  d.  The days on which the class meets (for example "MWF" or "TH").

  e.  The start time of the class 
  
  f.  The instructor of the class (who is a Monster)

  
5. For locations we want to record:

  a. A two-character building code (e.g., "MH" for Memorial Hall).

  b. The room number between 1 and 2000.

  c. The max capacity between 10 and 300.

6. Some Monsters are Alumni, who have graduated from the school. For alumni we also want to record:

  a. the year they graduated, and
  
  b. their degree (computer science, business, English, etc.).

7.	Formulate THREE additional business rules of your choice. Remember, you’ll eventually need to implement these! At least ONE of these rules should involve a new entity, relationship, and/or constraint (as opposed to simply a new attribute).

##Your New Business Rules Here:
1. Some classes may have more than one instructor, but every class has at least one instructor.

2. Each instructor has an email and phone number.

3. Some monsters have issues with dicipline, which need to be recorded for further action.

#Part 2: Conceptual Modeling using Entity-Relationship Diagramming
In this step, I'd like to create an ERD for the business rules above using [Diagrams.net](https://diagrams.net). You should include all entities, attributes, relationships, and cardinalilities. After you have completed this diagram, you should do the following:

1. Export it as "SVG" file in diagrams.net, and save this to your computer.
2. Edit this cell, and select the "Insert Image" button.
3. Select the SVG file you download.
4. NOTE: SVG files will work much better than larger image files (which may cause problems if you try to insert them).

INSERT SVG FILE HERE.![image.png]()

#Part 3: Logical Modeling
In this part, I'd like you to map the E-R model you've created to a relational model. This involves creating a relational scheme like the following:


```
table_name_1(attribute1 (PK), attribute2, attribute3)
table_name_2(attribute1 (PK), attribute2, attribute3)

```
You should indicate any **primary keys** by using (PK) and any foreign keys with (FK). For primary keys, you'll need to think about whether you can/should use attributes included in the ER diagram, or whether you might want to to create new attributes to serve as keys.

I recommend creating entities in this order:
1. One table for each "strong" entity in the E-R diagram. Decide on a primary key.
2. Tables for subtypes, if needed.
3. One table for each "weak" entity (besides subtypes) in the E-R diagram. Decide on appropriate primary and foreign keys.
4. Tables needed to model M:N relationships present in the E-R diagram.

**PUT YOUR ANSWER BELOW.**
```
monster(MonsterID (PK), Name, Species, DOB, Diet, GPA, Credits)
alumni(MonsterID (FK), GradYear, Degree)
teacher(MonsterID (FK), Email, Phone)
class(ClassID (PK), Title, Location (FK), Duration, Days, Start_Time, Instructor(FK))
location(locationID (PK), Building, Room, MaxCapacity)
```

#Part 4: Normalization
Are your relations normalized? Please provide a 2-3 sentence explanation of why/how they meet the following normal forms. Or, if they don't, describe what needs to be done to change them.

1. **First Normal Form.** 
The relations are in 1NF because each table has its own primary key, and because each attribute has only one value. Each table stores a specific entity, and there is no table doing more than one job.
2. **Second Normal Form.**
The relations are in 2NF because all attributes in each table depend on the primary key. Each attribute can help uniquely identify each entity.
3. **Third Normal Form.** 
The relations are in 3NF because there aren't any transitive depenencies. All of the attributes in each table need the primary key to be identified correctly.
**Revised relational scheme (if needed):**

**Revised relational scheme (if needed):**
(Your answer here).

#Part 5: Creating Tables
In this part, you'll be creating the tables to store the data about your monstrous students. This involves "mapping" the relational schema to an actual Postgres Databases. Here's what you need to do:

1. CREATE a SQL table for each of the relations you identied in part 4.
2. Make sure all the attribututes are assigned appropriate data types. For example, INTEGER, VARCHAR, or DATE.
3.  Assign appropriate primary keys and foreign keys.

In the starter code below, I've assumed you'll have tables along the line of the following. However, you should feel free to rename, add, or delete tables as needed!

a. Monsters

b. Classes

c. Locations

d. Monsters2Classes

e. Alumni

In [ ]:
%%sql 
--If you make mistakes you might need to drop tables and start again
--Here's one way of doing this (run this cell as needed)
--You might need to change table names!

DROP TABLE IF EXISTS Alumni CASCADE;
DROP TABLE IF EXISTS Monsters CASCADE;
DROP TABLE IF EXISTS Classes CASCADE;
DROP TABLE IF EXISTS Locations CASCADE;
DROP TABLE IF EXISTS Monsters2Classes CASCADE;

In [2]:
%%sql
--Here's the start of one create table statement
--You'll need to create each table individually
--You also need some contraints here!

CREATE TABLE Monsters(
  id INTEGER PRIMARY KEY,
  name VARCHAR(26),
  dob DATE,
  species VARCHAR(10),
  diet VARCHAR(15),
  gpa NUMERIC(3,2),
  credits INTEGER,
  strikes INTEGER
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [3]:
%%sql

CREATE TABLE Locations(
  id VARCHAR(6) PRIMARY KEY,
  building VARCHAR(2),
  room INTEGER,
  max INTEGER
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [4]:
%%sql 


CREATE TABLE Classes(
  id INTEGER PRIMARY KEY,
  name VARCHAR(100),
  location VARCHAR(6),
  duration INTEGER,
  days VARCHAR(3),
  start VARCHAR(7),
  instructor INTEGER
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [5]:
%%sql 

CREATE TABLE Alumni(
  id INTEGER,
  year INTEGER,
  degree VARCHAR(30)
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [6]:
%%sql

CREATE TABLE Teacher(
  id INTEGER,
  email VARCHAR(50),
  phone VARCHAR(15)
)

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [7]:
%%sql

CREATE TABLE Monsters2Classes(
  MonsterID INTEGER,
  ClassID INTEGER
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

#Part 6: Retrieving, Updating, and Deleting Data
In this part, you'll be inserting some data about Monsters, Classes, and Locations.

##6b. Inserting Data
Here are five monsters to insert your database:

1. Cookie Monster (unknown species) was born on Nov 10, 1969. His eats only cookies. He has 3.2 GPA and has completed 76 credits.
2. Marceline (vampire) was born in Feb 3, 1056. She eats "the color red". She is a teacher with a 0.0 GPA and 0 credits completed.
3. Chewbacca (wookie) was born on May 25, 1977. He is an omnivore. He has a 2.6 GPA and has completed 24 credits.
4. Dracula (vampire) was born on Aug 15, 1543. He drinks blood. He has a 4.0 GPA with 112 credits completed. He also teachers classes.
5. Maleficient (dragon) was born on Oct 26, 1856. She is a carnviore. She has a 3.8 GPA with 63 credits completed.
6. Insert at least FOUR more monsters of your choice. At least two of these should have the same species.

Now, show the data in the table.

Here are three locations to insert into your database:
1. CL 101 ("Castle level 1, room 1") holds 100 people.
2. CL 503 ("Castle level 5, room 3") holds 34 people.
3. MU 220 ("Monster Union room 220") holds 12 people.
4. Insert at least TWO more locations into your database. Both should be in the same building. 

Now, show the data in the table.


Here are two classes to insert into your database:
1. Marceline teaches Intro to Guitar on TH from 2 PM to 4 PM in MU 220.
2. Dracula teaches Monster First Aid on MWF from 9 PM to 10 PM in CL 503.
2. Insert at least ONE more class.

Now, show the data in the table.


"ENROLL" some students in your classes.
1. Cookie Monster, Chewbacca, and Maleficient (and perhaps some of the students you added) will take Monster First Aid.
2. Chewbacca and Malificient (and perhaps some of the students you added) will take Intro to Guitar.
3. Enroll some students in your own class!
Now, show the data in the table.


Finally, insert data for at least ONE alumni, and show the results.

In [69]:
%%sql 
-- If you make mistakes, you might need to delete existing data from your tables. 
-- One way you might do this is as follows
-- You might need to include different table names!

DELETE FROM Monsters CASCADE;
DELETE FROM Locations CASCADE;
DELETE FROM Classes CASCADE;
DELETE FROM Alumni CASCADE;
DELETE FROM Monsters2Classes CASCADE;

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [8]:
%%sql
--- Insert the data on Monsters. You'll be using statements like the following:
--INSERT INTO Monsters(id, name, ...) VALUES (1, 'Cookie Monster', ...);

--When you are done inserting, you should display the data, like so:
--SELECT * FROM Monsters;

INSERT INTO Monsters(id, name, dob, species, diet, GPA, credits)
 VALUES(506, 'Marceline', '1056-02-03', 'Vampire', 'the color red', 0.0, 0);
INSERT INTO Monsters(id, name, dob, species, diet, GPA, credits)
 VALUES(507, 'Chewbacca', '1977-05-25', 'Wookie', 'Omnivore', 2.6, 24);
INSERT INTO Monsters(id, name, dob, species, diet, GPA, credits)
 VALUES(508, 'Dracula', '1543-08-15', 'Vampire', 'Blood', 4.0, 112);
INSERT INTO Monsters(id, name, dob, species, diet, GPA, credits)
 VALUES(509, 'Maleficient', '1856-10-26', 'Dragon', 'Carnivore', 3.8, 63);
INSERT INTO Monsters(id, name, dob, species, diet, GPA, credits)
 VALUES(510, 'Cookie Monster', '1969-11-10', NULL, 'Cookies', 3.2, 76);

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%%sql
SELECT * FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[(506, 'Marceline', datetime.date(1056, 2, 3), 'Vampire', 'the color red', Decimal('0.00'), 0),
 (507, 'Chewbacca', datetime.date(1977, 5, 25), 'Wookie', 'Omnivore', Decimal('2.60'), 24),
 (508, 'Dracula', datetime.date(1543, 8, 15), 'Vampire', 'Blood', Decimal('4.00'), 112),
 (509, 'Maleficient', datetime.date(1856, 10, 26), 'Dragon', 'Carnivore', Decimal('3.80'), 63),
 (510, 'Cookie Monster', datetime.date(1969, 11, 10), None, 'Cookies', Decimal('3.20'), 76)]

In [10]:
%%sql
INSERT INTO Locations(id, building, room, max)
 VALUES('CL101', 'CL', 101, 100);
INSERT INTO Locations(id, building, room, max)
 VALUES('CL503', 'CL', 503, 34);
INSERT INTO Locations(id, building, room, max)
 VALUES('MU220', 'MU', 220, 12);
INSERT INTO Locations(id, building, room, max)
 VALUES('DG564', 'DG', 564, 30);
INSERT INTO Locations(id, building, room, max)
 VALUES('DG156', 'DG', 156, 30);

SELECT * FROM Locations;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[('CL101', 'CL', 101, 100),
 ('CL503', 'CL', 503, 34),
 ('MU220', 'MU', 220, 12),
 ('DG564', 'DG', 564, 30),
 ('DG156', 'DG', 156, 30)]

In [25]:
%%sql

INSERT INTO Classes VALUES(1, 'Intro to Guitar', 'MU220', 120, 'TH', '2:00pm', 506);
INSERT INTO Classes VALUES(2, 'Monster First Aid', NULL, 60, 'MWF', '9:00pm', 508);
INSERT INTO Classes VALUES(3, 'Torture 101', 'DG564', 240, 'MWF', '10:00pm', 509);

SELECT * FROM Classes;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
3 rows affected.

[(1, 'Intro to Guitar', 'MU220', 120, 'TH', '2:00pm', 506),
 (2, 'Monster First Aid', None, 60, 'MWF', '9:00pm', 508),
 (3, 'Torture 101', 'DG564', 240, 'MWF', '10:00pm', 509)]

In [12]:
%%sql


INSERT INTO Alumni VALUES(506, 1452, 'Music');

SELECT * FROM Alumni;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.

[(506, 1452, 'Music')]

In [13]:
%%sql

INSERT INTO Monsters2Classes VALUES(507, 2);
INSERT INTO Monsters2Classes VALUES(508, 2);
INSERT INTO Monsters2Classes VALUES(509, 2);
INSERT INTO Monsters2Classes VALUES(510, 2);
INSERT INTO Monsters2Classes VALUES(507, 1);
INSERT INTO Monsters2Classes VALUES(509, 1);

SELECT * FROM Monsters2Classes;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
6 rows affected.

[(507, 2), (508, 2), (509, 2), (510, 2), (507, 1), (509, 1)]

#6c: Updating Data
In this section, I'd like you to run the following updates

1. MU 220 has been expanded! It can now hold 25 students, instead of 12.
2. Another semester has passed. Add 12 credits to each student's record.
3. [Another update of your choice--describe here.]

After each update please SELECT from the table to show the results.

In [14]:
%%sql

UPDATE Locations SET max = 25 WHERE id = 'MU220';

SELECT * FROM LOCATIONS;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
5 rows affected.

[('CL101', 'CL', 101, 100),
 ('CL503', 'CL', 503, 34),
 ('DG564', 'DG', 564, 30),
 ('DG156', 'DG', 156, 30),
 ('MU220', 'MU', 220, 25)]

In [15]:
%%sql 
UPDATE Monsters SET credits = credits + 12;

SELECT * FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.
5 rows affected.

[(506, 'Marceline', datetime.date(1056, 2, 3), 'Vampire', 'the color red', Decimal('0.00'), 12),
 (507, 'Chewbacca', datetime.date(1977, 5, 25), 'Wookie', 'Omnivore', Decimal('2.60'), 36),
 (508, 'Dracula', datetime.date(1543, 8, 15), 'Vampire', 'Blood', Decimal('4.00'), 124),
 (509, 'Maleficient', datetime.date(1856, 10, 26), 'Dragon', 'Carnivore', Decimal('3.80'), 75),
 (510, 'Cookie Monster', datetime.date(1969, 11, 10), None, 'Cookies', Decimal('3.20'), 88)]

In [16]:
%%sql 

UPDATE Locations SET max = 75 WHERE building = 'DG';

SELECT * FROM Locations;

 * postgresql://postgres:***@localhost/my_data
2 rows affected.
5 rows affected.

[('CL101', 'CL', 101, 100),
 ('CL503', 'CL', 503, 34),
 ('MU220', 'MU', 220, 25),
 ('DG564', 'DG', 564, 75),
 ('DG156', 'DG', 156, 75)]

#Part 7: SQL Queries
In this section, you'll be demonstrating your ability to retrieve data from the database you've created using SQL queries.

##7a: Simple Single table queries
Retreive a list of monsters ordered alphabetically by name. Limit your results to 5.

In [17]:
%%sql

SELECT * FROM Monsters ORDER BY name LIMIT 5;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[(507, 'Chewbacca', datetime.date(1977, 5, 25), 'Wookie', 'Omnivore', Decimal('2.60'), 36),
 (510, 'Cookie Monster', datetime.date(1969, 11, 10), None, 'Cookies', Decimal('3.20'), 88),
 (508, 'Dracula', datetime.date(1543, 8, 15), 'Vampire', 'Blood', Decimal('4.00'), 124),
 (509, 'Maleficient', datetime.date(1856, 10, 26), 'Dragon', 'Carnivore', Decimal('3.80'), 75),
 (506, 'Marceline', datetime.date(1056, 2, 3), 'Vampire', 'the color red', Decimal('0.00'), 12)]

##7b. Single-table queries with WHERE and LIKE
Retrieve JUST the classes that meet on Wednesday (where Wednesday is the 'W' in strings like 'MWF').

In [27]:
%%sql

SELECT * FROM Classes WHERE days LIKE '%W%';

 * postgresql://postgres:***@localhost/my_data
2 rows affected.

[(2, 'Monster First Aid', None, 60, 'MWF', '9:00pm', 508),
 (3, 'Torture 101', 'DG564', 240, 'MWF', '10:00pm', 509)]

##7c. Single-table queries with aggregate functions
Retrieve the minimum, maximum, and average GPA included in your database. You should label the columns "Min GPA", "Max GPA", and "Avg GPA".

In [31]:
%%sql 
SELECT MIN(gpa) AS "Min GPA", MAX(gpa) AS "Max GPA", AVG(gpa) AS "Avg GPA" FROM monsters;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[(Decimal('0.00'), Decimal('4.00'), Decimal('2.7200000000000000'))]

##7d. Single table queries with GROUP BY
Retrieve a list of each monster species included in the database, along with a count of how many monsters are members of the species.

In [34]:
%%sql
SELECT COUNT(species), species FROM Monsters GROUP BY species;

 * postgresql://postgres:***@localhost/my_data
4 rows affected.

[(0, None), (2, 'Vampire'), (1, 'Dragon'), (1, 'Wookie')]

##7e. Single-table queries with HAVING
Retrieve a list of the buildings (not rooms!) in your data that have a total capacity of more than 20. (A building's capacity is simply the sum of the capacities of all the classrooms it contains).

In [40]:
%%sql

SELECT building, SUM(max) FROM Locations GROUP BY Building HAVING SUM(max) > 20;

 * postgresql://postgres:***@localhost/my_data
3 rows affected.

[('CL', 134), ('MU', 25), ('DG', 150)]

##7f. Subqueries
Retrieve a list of monsters names and species, together with a count of how many members of that species are in the database.

In [45]:
%%sql
SELECT name, species, SUM(species) FROM Monsters GROUP BY species;

 * postgresql://postgres:***@localhost/my_data
(psycopg2.ProgrammingError) function sum(character varying) does not exist
LINE 1: SELECT name, species, SUM(species) FROM Monsters GROUP BY sp...
                              ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.

[SQL: SELECT name, species, SUM(species) FROM Monsters GROUP BY species;]
(Background on this error at: https://sqlalche.me/e/14/f405)

#7g. Simple multi-table queries with JOIN
Retrieve the names and GPAs of students enrolled in Intro to Guitar.

In [49]:
%%sql
SELECT monsters.name, monsters.gpa FROM Monsters JOIN Monsters2Classes ON monsters.id = Monsters2Classes.MonsterID JOIN Classes ON Classes.id = Monsters2Classes.ClassID WHERE Classes.id = 1;

 * postgresql://postgres:***@localhost/my_data
2 rows affected.

[('Chewbacca', Decimal('2.60')), ('Maleficient', Decimal('3.80'))]

##7h. More complex multi-table queries
Retrieve the total students taught by each teacher in the database. You should have one row of output for each teacher with their name and the total number of students.

In [64]:
%%sql 
SELECT Monsters.name, COUNT(Monsters2Classes.ClassID) AS "Number of Students" FROM Monsters JOIN Classes ON Monsters.ID = Classes.instructor JOIN Monsters2Classes ON Classes.id = Monsters2Classes.ClassID GROUP BY Monsters.Name;

 * postgresql://postgres:***@localhost/my_data
2 rows affected.

[('Marceline', 2), ('Dracula', 4)]

##7i. Creation of Views
Create a VIEW based on a SQL query of your choice. Now "SELECT *" from this view to show the results.

In [67]:
%%sql
CREATE VIEW Vampires AS 
SELECT name, gpa, diet FROM Monsters WHERE species = 'Vampire';

SELECT * FROM Vampires;

 * postgresql://postgres:***@localhost/my_data
Done.
2 rows affected.

[('Marceline', Decimal('0.00'), 'the color red'),
 ('Dracula', Decimal('4.00'), 'Blood')]

##7g. Creation of Indexes.
Create an index on the column that contains the Monster's names.

In [68]:
%%sql
CREATE INDEX monsternames ON Monsters(name);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

#8. Database Design Philosophy
In 150 to 200 words, answer the question **"What are the keys to designing a successful database, and how is this reflected in your own work here?"**

The main key for a successful database is to be organized. Instead of having all of your data in one garbled mess of a table, you can organize the data into multiple tables grouped by whatever makes sense. All of the students' info is in one table, class data in another, locations in another, etc. all combining into one "main" table that only has two columns. By organizing data, it can be easier to see what you're trying to look for, and it'll be easier to manage because you only need one number to access information on a particular monster or class. Another key is to be simple. Just one, or maybe two words to describe the field or table. It doesn't need to be a long sentence, becuase it'll be more difficult to access data in the future if it's too long. Something that's unique, but also easy to read and remember.

#9. Be Creative!
In 150 to 200 words, tell me about what you've done (or will do, in this section) that goes above and beyond the "requirements" of the assignment. Why did you choose to do this? What did you learn from doing it?

I'm going to alter the tables to add some constraints to fields that need them. First, I'm going to set the gpa by default to 0.0, set the default species to null, and set the default credits and strikes to 0. If multiple new students join the class, all of them all start with 0. To make the process faster, and for us to be able to only add in the values we need to add, those defaults must be in place. I learned that it's fairly easy to add a constraint, and change the constraint if I messed something up in the process. I'm also going to add in contact emails and phone numbers for the different instructors in the database. If the need arises where a student needs to reach an instructor by phone or email, it's right there. Meanwhile, students don't really need this since they can just contact the teacher using their own email.

(Feel free to add code cells below if needed.)

In [74]:
%%sql

ALTER TABLE Monsters ALTER gpa SET DEFAULT 0.0;
ALTER TABLE Monsters ALTER species SET DEFAULT NULL;
ALTER TABLE Monsters ALTER credits SET DEFAULT 0;
ALTER TABLE Monsters ALTER strikes SET DEFAULT 0;

INSERT INTO Teacher VALUES(506, 'marceline@transylvania.edu', '465-512-3546');
INSERT INTO Teacher VALUES(508, 'thecount@transylvania.edu', '514-656-4898');
INSERT INTO Teacher VALUES(509, 'maleficent@transylvania.edu', '485-964-8596');

 * postgresql://postgres:***@localhost/my_data
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#10. Share Work With Me on Github
Finally, I'd like you to share your work with me on Github. If you are interesting in working in computer science or IT, it's good to have a basic understanding of how Github works, as its something like an industry "standard" way of sharing code. 
 
Here's what you need to do:
1. Create an account on https://github.com/ 
2. Create a PUBLIC repository called "database_sql".
3. Save your **completed** lab to this repository. From colab, all you need to do is go to "File: Save a copy in Github."

An in-depth tutorial on using Github is here:
https://docs.github.com/en/get-started/quickstart/hello-world 
The only things you need to worry about are (a) creating an account and (b) creating a repository. We won't be worry about branches, commits, or pulls (though you are free to read up on these!). 

Once you've done this, please write down your:

USERNAME: VillagerTime

REPOSITORY LINK: https://github.com/VillagerTime/database_sql

And that's it! I've enjoyed having you in class--enjoy the rest of the semster :).

**You should also submit this to the D2L Assignment folder.**